# utils/text_normalization.py

def greeklish_to_greek(word):
    patterns = [
        ('th', 'θ'), ('ps', 'ψ'), ('ks', 'ξ'), ('ch', 'χ'), ('ou', 'ου'), ('ai', 'αι'), ('ei', 'ει'), ('oi', 'οι'),
        ('mp', 'μπ'), ('nt', 'ντ'), ('gk', 'γκ'),
        ('a', 'α'), ('b', 'β'), ('c', 'κ'), ('d', 'δ'), ('e', 'ε'), ('f', 'φ'), ('g', 'γ'), ('h', 'η'), ('i', 'ι'),
        ('j', 'ζ'), ('k', 'κ'), ('l', 'λ'), ('m', 'μ'), ('n', 'ν'), ('o', 'ο'), ('p', 'π'), ('q', 'κ'), ('r', 'ρ'),
        ('s', 'σ'), ('t', 'τ'), ('u', 'υ'), ('v', 'β'), ('w', 'ω'), ('x', 'χ'), ('y', 'υ'), ('z', 'ζ')
    ]
    w = word.lower()
    for k, v in patterns:
        w = w.replace(k, v)
    return w
